app/Validation/Userrules.php

    public function validateUser(string $str, string $fields, array $data) {
        $model = new UsuarioModel();

        $user = $model->where('codigo', $data['codigo'])->first();
---
SELECT *
FROM `usuarios`
WHERE `codigo` = '20TE0422'
 LIMIT 1