app/Controllers/JefeCarrera/UsuarioController.php

    public function index()
    {
        $usuarios = $this->usuario->findAll();


        $data = [
            'usuarios' => $usuarios,
            'perfiles'  => $this->perfil->findAll()
---
SELECT *
FROM `usuarios`
SELECT *
FROM `perfiles`